// 1. Зробив двома способами
if (humb > 2) {
    if (free > 0) {
        console.log('Ми поїли')
    } else {
        console.log('Ми йдемо в інше кафе')
    }
} else {
    console.log('Ми йдемо в інше кафе')
}

if (gumb > 2 && free > 0) {
    console.log('Ми поїли')
} else {
    console.log('Ми йдемо в інше кафе')
}

//2
let price = 999;
if (price >= 1000 && price <= 1900) {
    console.log('true');
} else {
    console.log('false');
}

//3
let res = (price >= 1000 && price <= 1900)
console.log(res)
if (res != true) {
    console.log('не в діапазоні')
} else {
    console.log('в діапазоні')
}

let res = (price >= 1000 && price <= 1900)
console.log(res)
if (res == true) {
    console.log('в діапазоні')
} else {
    console.log('не в діапазоні')
}

//4

let season = 7

if (season === 12 || season === 1 || season === 2) {
    console.log('season is winter')
} else if (season === 3 || season === 4 || season === 5) {
    console.log('season is spring')
} else if (season === 6 || season === 7 || season === 8) {
    console.log('season is summer')
} else {
    console.log('season is autumn')
}

//5

if (a > b && a > c) {
    if (b > c) {
        console.log('b is middle')
    } else {
        console.log('c is middle')
    }
} else if (b > a && b > c) {
    if (a > c) {
        console.log('a is middle')
    } else {
        console.log('c is middle')
    }
} else {
    if (a > b) {
        console.log('a is middle')
    } else {
        console.log('b is middle')
    }
}


/*
Домашка:

1.  Ви прийшли в Макдональдз з трьома друзями.
    Всі вони хочуть зʼїсти гамбургер. Ви хочете зʼїсти гамбургер з картоплею.
    Реалізувати код, який буде перевіряти, що якщо всім вистачає гамбургерів і картоплі,
    то виводити текст "Ми поїли" в консоль. Якщо на всіх не вистачає їжі,
    то виводити в консоль текст "Ми йдемо в інше кафе"
    (Змінні типу інтеджер містять кількість продуктів в наявності у вигляді вхідних даних)

2.  Напишіть умовну інструкцію if, що перевіряє, чи знаходиться значення ціни товару між 1000 та 1900 включно.
    Результат виводити в консоль.

3.  Напишіть умовну інструкцію if, щоб перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
    Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
    Результат виводити в консоль.

4.  За номером пори року вивести назву цієї пори року використовуючи інструкцію if-else-if
    Результат виводити в консоль.

5.  Задано 3 числа (a, b, c), які не рівні між собою.
    Використовуючи вкладені умовні оператори (інструкції) if визначте середнє між цими трьома числами
    (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням)
    Результат виводити в консоль.

6.  Задано номер дня тижня.
    За заданим номером вивести назву дня тижня використовуючи switch.
    Результат виводити в консоль.

7.  За допомогою switch реалізуйте обчислення виразу, передаючи у switch, як параметр, символ математичної операції.
    Математичні операції для обчислення: "+", "-", "*", "/".
    Результат виводити в консоль.

8. Використовуючи цикл for перемістити значення від 1 до 5 у масив myArray.

9. Напишіть 2 цикли.
   За допомогою першого передайте парні числа від 1 до 9 у змінну myArray за допомогою циклу for.
   За допомогою другого передайте непарні числа від 1 до 9 у змінну myArray за допомогою циклу for.

10. Оголоcіть та ініціалізуйте змінну total = 0.
    Використовуйте цикл for, щоб додати значення кожного елемента масиву myArr до підсумку.
    const myArr = [2, 3, 4, 5, 6];

11. Напишіть код, котрий виведе в консоль кожен піделемент в arr по одному.

    const arr = [ [1, 2], [3, 4], [5, 6] ];

    Console output:
    1
    2
    3
    4
    5
    6

12. Доповніть код нижче, так щоб в консоль повертався результат множення усіх чисел у підмасивах arr.
    Використайте для цього вкладені цикли for.

    Наприклад:
    const arr = [[1], [2], [3]]  >  console.log(product) має повернути 6
    const arr = [[1, 2], [3, 4], [5, 6, 7]]  >  console.log(product) має повернути 5040
    const arr = [[5, 1], [0.2, 4, 0.5], [3, 9]]  >  console.log(product) має повернути 54

    const arr = [[1, 2], [3, 4], [5, 6, 7]];

    let product = 1;

    // тут має бути ваше рішення

    console.log(product);

13.*  Використовуючи властивості рядків (тип string), та регулярний вираз (regular expression) видалити голосні букви зі слова.

14.*  Використовуючи оператор if реалізувати логіку переводу метрів в кілометри,
    так щоб в консоль виводився результат обчислень з правильним закінченням.
    Наприклад: 1000 метрів це 1 кілометр;  32 метри це 0,032 кілометра і т.д.

    Підказка(https://ukr-lifehacks.ed-era.com/rozdil-9/zvyazok_chislivnykiv)

    Дані (метри) для перевірки написаного рішення: [0, 5, 11, 19, 21, 101, 1001, 2, 3, 4, 22, 23, 24, 10, 20, 25, 30, 40, 1.5, 2.3, 100.7]
*/
